Repository: ekasit-ja/pcj-django
Catalog: locale/*/LC_MESSAGES/django.po
Languages: th

# list-fdc-content-1
source: <p>Fire dampers, curtain type, by PCJ, are constructed of galvanized steel sheets, high strength structure, frame shape is modular design to be suitable for mounting in duct line or connecting together with other fire dampers as multiple section. The dampers have been tested and certified for 3-hour fire rating as per ANSI/UL 555 & CAN/ULC-S112. Single Section, Multiple Section, In Airstream, Out of Airstream are available upon request to fulfill most requirements. Size can be made to order up to maximum :</p><ul><li>1220 mm. x 1220 mm. (48” x 48”) for Single Section</li><li>2440 mm. x 2440 mm. (96” x 96”) for Multiple Section</li></ul><p>We recommend application of our fire dampers for blocking spread of fire passing through duct line, ventilation fan, air louver as well as indoor glass panel, especially large size of glass panel when fire or heat approaches the dampers.</p>
th: <p>แดมเปอร์ทนไฟแบบม่านตกของพีซีเจ ผลิตจากสังกะสีแผ่นเรียบ ความแข็งแรงสูง เฟรมแบบมอดูลาร์ (Modular) เพื่อไว้ใช้สำหรับติดตั้งในท่อลม หรือต่อแดมเปอร์ทนไฟหลายตัวเข้าด้วยกัน แดมเปอร์ได้รับการทดสอบและรับรองอัตราการทนไฟ 3 ชั่วโมง ตามมาตรฐาน ANSI/UL 555 & CAN/ULC-S112 แดมเปอร์มีจำหน่ายทั้งแบบ Single Section (ตัวเดียว), Multiple Section (หลายตัวต่อกัน), In Air Stream (ใบแดมเปอร์อยู่ในท่อลม)และ Out of Air Stream (ใบแดมเปอร์อยู่นอกท่อลม) เพื่อตอบสนองความต้องการของการใช้งานทุกประเภท แดมเปอร์สามารถผลิตได้ที่ขนาดใหญ่สุด</p><ul><li>1220 มม. x 1220 มม. (48” x 48”) สำหรับ Single Section</li><li>2440 มม. x 2440 มม. (96” x 96”) สำหรับ Multiple Section</li></ul><p>แนะนำการใช้งานสำหรับป้องกันไฟไม่ให้ลามผ่านท่อลม พัดลมระบายอากาศ แอร์ลูเวอร์ หรือช่องกระจกภายในอาคาร โดยเฉพาะกับช่องขนาดใหญ่ เมื่อไฟหรือความร้อนมาถึงแดมเปอร์</p>

# list-ddp-content-1
source: <p>Dampers, by PCJ, are constructed of galvanized steel sheets, high strength structure and durable. Our dampers are designed to suit each particular function and are available in many types, such as,</p><ul><li>Fire dampers, 3-hour fire rating as per UL 555, tested by King Mongkut's Institute of Technology Ladkrabang (KMIT)</li><li>Combination of fire & smoke dampers, 3-hour fire rating as per UL 555 and UL 555s, tested by King Mongkut's Institute of Technology Ladkrabang (KMIT)</li><li>Volume dampers</li><li>Motorized dampers</li><li>Gravity dampers</li><li>Relief dampers</li></ul><p>Our dampers are available at any sizes upon requested (made to order) and can be made to suit any installation method. For exmample,</p><ul><li>Flange type</li><li>Plain end type, crank arm/actuator inside wall</li><li>Plain end type, crank arm/actuator outside wall</li><li>Drive slip type</li></ul>
th: <p>ผลิตจากสังกะสีแผ่นเรียบ ความแข็งแรงสูง อายุการใช้งานยาวนาน แดมเปอร์ประเภทต่างๆ ถูกออกแบบมาเพื่อรองรับการใช้งานตามความต้องการเฉพาะทาง แดมเปอร์ของเรามีจำหน่ายหลากหลายประเภท อาทิ</p><ul><li>แดมเปอร์ทนไฟ อัตราการทนไฟ 3 ชั่วโมง ตามมาตรฐาน UL 555 (ทดสอบโดยสถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง)</li><li>ไฟร์สโมคแดมเปอร์ อัตราการทนไฟ 3 ชั่วโมง ตามมาตรฐาน UL 555 และ UL 555S (ทดสอบโดยสถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง)</li><li>วอลุ่มแดมเปอร์</li><li>มอเตอร์ไรซ์แดมเปอร์</li><li>กราวิตี้แดมเปอร์</li><li>รีลีฟแดมเปอร์</li></ul><p>แดมเปอร์ของเรามีจำหน่ายทุกขนาดขนาดตามสั่ง และสามารถเลือกผลิตตามลักษณะการติดตั้งที่หน้างานได้หลากหลายรูปแบบ อาทิเช่น</p><ul><li>แบบมีหน้าแปลน</li><li>แบบใส่เข้าไปในท่อลม ก้านปรับ/หัวขับ (Actuator) ในผนัง</li><li>แบบใส่เข้าไปในท่อลม ก้านปรับ/หัวขับ (Actuator) นอกผนัง</li><li>แบบตีเสียบ</li></ul>

# vd
source: Volume Damper, Ordinary
th: วอลุ่มแดมเปอร์ แบบธรรมดา

# vl
source: Volume Damper, Low Leak
th: วอลุ่มแดมเปอร์ แบบรั่วน้อย

# md
source: Motorized Damper, Ordinary
th: มอเตอร์ไรซ์แดมเปอร์ แบบธรรมดา

# ml
source: Motorized Damper, Low Leak
th: มอเตอร์ไรซ์แดมเปอร์ แบบรั่วน้อย

# fsd
source: Combination of Fire and Smoke Damper
th: ไฟร์สโมคแดมเปอร์

# rvd
source: Round Volume Damper, Ordinary
th: วอลุ่มแดมเปอร์ แบบกลม แบบธรรมดา

# rvl
source: Round Volume Damper, Low Leak
th: วอลุ่มแดมเปอร์ แบบกลม แบบรั่วน้อย

# rmd
source: Round Motorized Damper, Ordinary
th: มอเตอร์ไรซ์แดมเปอร์ แบบกลม แบบธรรมดา

# rml
source: Round Motorized Damper, Low Leak
th: มอเตอร์ไรซ์แดมเปอร์ แบบกลม แบบรั่วน้อย

# ovd
source: Flat Oval Volume Damper, Ordinary
th: วอลุ่มแดมเปอร์ แบบรี แบบธรรมดา

# ovl
source: Flat Oval Volume Damper, Low Leak
th: วอลุ่มแดมเปอร์ แบบรี แบบรั่วน้อย

# omd
source: Flat Oval Motorized Damper, Ordinary
th: มอเตอร์ไรซ์แดมเปอร์ แบบรี แบบธรรมดา

# oml
source: Flat Oval Motorized Damper, Low Leak
th: มอเตอร์ไรซ์แดมเปอร์ แบบรี แบบรั่วน้อย

# gd
source: Gravity Damper
th: กราวิตี้แดมเปอร์

# rd
source: Relief Damper
th: รีลีฟแดมเปอร์

# list-ds-content-1
source: <p>Our duct silencers and acoustic louvers are constructed of galvanized steel sheets, high strength structure. The duct silencers have been tested and certified by N.A.T.A., Australia, for dynamic insertion loss (dB) as per AS 1277, available in rectangular and round shape at any sizes upon request (made to order) to fulfill most requirements. They can be mounted vertically or horizontally to reduce sound level to desired levels as required. It is recommended for reducing sound level in duct line, machine room where sound level is needed to be at required level.</p>
th: <p>อุปกรณ์ลดทอนเสียง ดักไซเลนเซอร์ และอคูสติกลูเวอร์ ของพีซีเจ ผลิตจากสังกะสีแผ่นเรียบ ความแข็งแรงสูง ผ่านการทดสอบการลดทอนเสียง และได้รับการรับรองโดย N.A.T.A., Australia, AS 1277 มีให้เลือกทั้งแบบสี่เหลี่ยมและแบบกลม ทุกขนาดตามต้องการ ไซเลนเซอร์สามารถนำไปติดตั้งได้ทั้งแนวตั้งและแนวราบเพื่อลดทอนเสียงให้อยู่ในระดับความดังที่ต้องการ แนะนำการใช้งานสำหรับลดทอนเสียงในท่อลม ห้องเครื่อง ที่ต้องควบคุมความดังให้อยู่ในระดับที่ต้องการ</p>

# list-ds-content-2
source: <p>The acoustic louvers are modular design to be suitable for connecting together as multiple section. We recommend application of our louvers for reducing sound level of air flow through wall.</p>
th: <p>อคูสติกลูเวอร์ของพีซีเจ ถูกออกแบบเป็นแบบมอดูลาร์ (Modular) เหมาะสำหรับต่อหลายตัวเข้าด้วยกันเป็น Multiple Section แนะนำการใช้งานสำหรับลดความดังเสียงของอากาศที่ไหลผ่านช่องผนัง</p>

# list-aol-content-1
source: <p> Air outlets (air grilles), "Stream Air" brand, are constructed of extruded aluminum (some types are constructed of aluminum and galvanized steel sheet), high strength structure. Various types are available to suit each particular function in order to fulfill most requirements, for example,</p><ul><li>Round ceiling diffusers</li><li>Square/Rectangular ceiling diffusers</li><li>Egg crate grilles</li><li>Double deflection grilles</li><li>Linear slot diffusers</li><li>Linear bar grilles</li><li>Air louvers</li><li>Accessories of air outlets, such as, Opposed blade volume dampers, Insect screens, Air filters</li></ul><p>Many types of our air outlets are tested and certified by N.A.T.A., Australia, for acoustic and air flow performance as per AS 1277 & ADC 1062 : GRID-84. We recommend application of our products in cooling air distribution system and ventilation system.</p>
th: <p>พีซีเจผลิตและจัดจำหน่ายหน้ากากแอร์ภายใต้แบรนด์ Stream Air สินค้าของเราผลิตจากอลูมิเนียมรีดเส้น (บางประเภทผลิตจากอลูมิเนียมและสังกะสีแผ่นเรียบ) ความแข็งแรงสูง มีจำหน่ายหลากหลายประเภทซึ่งได้รับการออกแบบมาเพื่อรองรับการใช้งานตามความต้องการเฉพาะทาง อาทิ</p><ul><li>หน้ากากแอร์แบบกลม (Round Ceiling Diffuser)</li><li>หน้ากากแอร์แบบสี่เหลี่ยมจัตุรัส/แบบสี่เหลี่ยมผืนผ้า (Square/Rectangular Ceiling Diffuser)</li><li>หน้ากากแอร์สี่เหลี่ยมลังไข่ (Egg Crate Grille)</li><li>หน้ากากแอร์แบบใบปรับได้สองชั้น (Double Deflection)</li><li>หน้ากากแอร์แบบสล็อต (Linear Slot Diffuser)</li><li>หน้ากากแอร์แบบแนวยาว (Linear Bar Grille)</li><li>แอร์ลูเวอร์</li><li>อุปกรณ์เสริมหน้ากากแอร์ เช่น แดมเปอร์สำหรับหน้ากากแอร์, มุ้งลวดกันแมลง, แอร์ฟิลเตอร์</li></ul><p>หน้ากากแอร์หลายประเภทผ่านการทดสอบเสียงและการไหลผ่านของอากาศและได้รับการรับรองโดย N.A.T.A., Australia, AS 1277 & ADC 1062 : GRID-84 แนะนำการใช้งานสินค้าของเราสำหรับระบบกระจายลมเย็นและระบบระบายอากาศ</p>

# rnd
source: Round Ceiling Diffuser
th: หน้ากากแอร์แบบกลม

# rndd
source: Round Ceiling Diffuser Damper
th: แดมเปอร์สำหรับหน้ากากแอร์แบบกลม

# scd
source: Square Ceiling Diffuser, Ordinary Face
th: หน้ากากแอร์สี่เหสี่ยมจัตุรัส คอตรง

# scx
source: Square Ceiling Diffuser, Extra Face
th: หน้ากากแอร์สี่เหสี่ยมจัตุรัส คอบาน

# rcd
source: Rectangular Ceiling Diffuser, Ordinary Face
th: หน้ากากแอร์สี่เหสี่ยมผืนผ้า คอตรง

# rcx
source: Rectangular Ceiling Diffuser, Extra Face
th: หน้ากากแอร์สี่เหสี่ยมผืนผ้า คอบาน

# ag1
source: Air Grille 1" Z-Blade
th: หน้ากากแอร์แบบสี่เหสี่ยมบานเกล็ด 1"

# ag2
source: Air Grille 2" Z-Blade
th: หน้ากากแอร์แบบสี่เหสี่ยมบานเกล็ด 2"

# eg
source: Egg Crate Grille
th: หน้ากากแอร์สี่เหสี่ยมลังไข่

# sar
source: Supply Air Register (Double Deflection)
th: หน้ากากแอร์สี่เหสี่ยมใบปรับได้สองชั้น

# lsd
source: Linear Slot Diffuser
th: หน้ากากแอร์แบบสล็อต

# lbg
source: Linear Bar Grille
th: หน้ากากแอร์แบบแนวยาว

# al1
source: Air Louver 4" Z-blade, 1 Bank
th: แอร์ลูเวอร์ 4" ใบเอียงด้านเดียว

# al2
source: Air Louver 4" Z-blade, 2 Bank
th: แอร์ลูเวอร์ 4" ใบเอียงสองด้าน

# obv
source: Opposed Blade Volume Damper
th: แดมเปอร์สำหรับหน้ากากแอร์

# is
source: Insect Screen
th: มุ้งลวดกันแมลง

# filter
source: Air Filter
th: แอร์ฟิลเตอร์

# vdo-gallery
source: Video Gallery
th: วิดีโอที่เกี่ยวข้อง
