Repository: ekasit-ja/pcj-django
Catalog: locale/*/LC_MESSAGES/django.po
Languages: th

# ds-desc-1
source: Constructed of galvanized steel sheets, high strength structure. The duct silencers have been dynamic insertion loss (dB) tested and certified by N.A.T.A., Australia, AS 1277. Available for rectangular and round shape at any sizes (made to order) upon request to fulfill most requirements. They can be mounted vertically or horizontally to reduce sound level to desire levels as requirements. Recommended to be used for reducing sound level in duct line, machine room where sound level is needed to be at required level.
th: ผลิตจากสังกะสีแผ่นเรียบ ความแข็งแรงสูง ดักไซเลนเซอร์และอคูสติกลูเวอร์ผ่านการทดสอบการลดทอนเสียง และได้รับการรับรองโดย N.A.T.A., Australia, AS 1277 มีให้เลือกทั้งแบบเหลี่ยมและกลมทุกขนาดตามต้องการ ไซเลนเซอร์สามารถนำไปติดตั้งได้ตั้งแนวตั้งและแนวราบเพื่อลดทอนเสียงให้อยู่ในระดับความดังที่ต้องการ แนะนำการใช้งานสำหรับลดทอนเสียงในท่อดักท์ ห้องเครื่อง ที่ซึ่งต้องควบคุมความดังให้อยู่ในระดับที่ต้องการ

# ds-desc-2
source: The acoustic louvers are modular design to be suitable for connecting together as multiple section. Recommended to be used for reducing sound level of air flow through wall.
th: อคูสดิกลูเวอร์ถูกออกแบบเป็นแบบมอดูลาร์ เหมาะสำหรับต่อหลายตัวเข้าด้วยกันเป็น Multiple Section แนะนำการใช้งานสำหรับลดความดังเสียงของอากาศที่ไหลผ่านช่องผนัง

# aol-desc
source: Constructed of extruded aluminum (some types are constructed of aluminum and galvanized steel sheet), high strength structure. Various types available, ie. : Round Ceiling Diffusers, Square Ceiling Diffusers, Rectangular Ceiling Diffusers, Air Grilles, Egg Crate Grilles, Supply Air Registers, Opposed Blade Volume Dampers, Linear Slot Diffusers, Linear Bar Grilles, Insect Screens, Air Filters, Air Louvers. Some types are acoustic and air flow performance tested and certified by N.A.T.A., Australia, AS 1277 & ADC 1062 : GRID-84. Each type is designed suitable for each particular function to fulfill most requirements. Recommended to be used for supply/return of cooling air distribution system, fresh/exhaust air of ventilation system.
th: ผลิตจากอลูมิเนียมเส้นหน้าตัด (บางประเภทผลิตจากอลูมิเนียมและสังกะสีแผ่นเรียบ) ความแข็งแรงสูง มีจำหน่ายหลากหลายประเภท อาทิ หน้ากากแอร์แบบกลม หน้ากากแอร์แบบจัตุรัส หน้ากากแอร์แบบสี่เหลี่ยมผืนผ้า แอร์กริล หน้ากากแอร์สี่เหลี่ยมลังไข่ หน้ากากแอร์แบบใบปรับได้สองชั้น แดมเปอร์สำหรับหน้ากากแอร์ หน้ากากแอร์แบบสล็อต หน้ากากแอร์แบบแนวยาว มุ้งลวดกันแมลง แอร์ฟิลเตอร์ แอร์ลูเวอร์ เป็นต้น หน้ากากหลายประเภทได้รับการทดสอบเสียงและการไหลผ่านของอากาศและได้รับการรับรองโดย N.A.T.A., Australia, AS 1277 & ADC 1062 : GRID-84 หน้ากากแต่ละประเภทถูกออกแบบมาเพื่อรองรับการใช้งานตามความต้องการเฉพาะทาง แนะนำการใช้งานสำหรับ หน้ากากลมเย็นและลมกลับระบบกระจายลมเย็น หน้ากากอากาศภายนอกและอากาศระบายระบบระบายอากาศ

# please-click
source: Please click catalogue tab to download the catalogue for more details.
th: กรุณาคลิกแท็บ Catalogue เพื่อดาวน์โหลดแคตาล็อคสำหรับรายละเอียดเพิ่มเติม

# meta-desc-home
source: We manufacture and supply steel doors, fire-rated steel doors, fire dampers, duct dampers, duct silencers, acoustic louvers, and air outlets (air grilles). With experience in this market for more than 20 years as well as certificates as per many international standards from world class instituitions, you can trust in excellent quality of our products and services.
th: เราคือผู้ผลิตประตูเหล็กทนไฟ ดักแดมเปอร์ ดักไซเลนเซอร์ และหน้ากากแอร์ชั้นนำของประเทศไทย นโยบายที่สำคัญที่สุดของเราคือการผลิตสินค้าตามมาตรฐานสากลอย่างเข้มงวด เพื่อให้มีคุณภาพดี โดยมีราคาน่าดึงดูดใจ และจัดส่งตรงเวลา เพื่อให้คุณสามารถสำเร็จโครงการได้ตรงเวลา อย่างเรียบร้อย โดยไม่มีสิ่งติดขัดใดๆ

# meta-title-frd
source: Steel doors
th: ประตูเหล็กทนไฟ, UL

# meta-desc-frd
source: PCJ manufactures and supplies Steel doors, and Fire-Rated Steel Doors, 3-Hour Fire Rating (UL 10C), 2-Hour Fire Rating (BS 476) upon any requests to fulfill most requirements.
th: เราผลิตและจัดจำหน่ายประตูเหล็กทนไฟ 3 ชั่วโมง (UL 10C), ทนไฟ 2 ชั่วโมง (BS 476), และประตูเหล็กธรรมดา เพื่อตอบสนองความต้องการของการใช้งานทุกประเภท

# meta-title-fdc
source: Fire dampers, UL certified
th: ไฟร์แดมเปอร์, UL

# meta-desc-fdc
source: PCJ manufactures and supplies Fire Dampers, 3-Hour Fire Rating (UL 555). The dampers are designed to automatically close by gravity in the event of fire when temperature at the dampers reach up to 165°F (74°C)
th: เราผลิตและจัดจำหน่ายแดมเปอร์ทนไฟ 3 ชั่วโมง (UL 555) แดมเปอร์ถูกออกแบบมาให้ปิดอัตโนมัติโดยแรงโน้มถ่วงในเหตุการณ์ไฟไหม้เมื่ออุณหภูมิที่แดมเปอร์สูงถึง 165 องศาฟาเรนไฮต์ (74 องศาเซลเซียส)

# meta-title-fsd-ul
source: Fire & smoke dampers
th: ไฟร์และสโมคแดมเปอร์

# meta-desc-fsd-ul
source: We manufacture and supply combination of Fire and Smoke Dampers, 3-Hour Fire Rating. The dampers are designed to automatically close by Actuators in the event of fire to block the spread of flame and/or smoke pass through the walls.
th: เราผลิตและจัดจำหน่ายไฟร์และสโมคแดมเปอร์ทนไฟ 3 ชั่วโมง แดมเปอร์ถูกออกแบบให้ปิดอัตโนมัติโดยแอคทูเอเตอร์ในเหตุการณ์ไฟไหม้ เพื่อป้องกันไม่ให้ไฟ และ/หรือ ควันทะลุผ่านไปยังอีกฝั่งของผนัง

# meta-title-ddp
source: Duct dampers, Other dampers
th: ดักแดมเปอร์, แดมเปอร์อื่นๆ

# meta-desc-ddp
source: PCJ manufactures and supplies Fire Dampers, Fire & Smoke Dampers, Volume Dampers, Motorized Dampers, Gravity Dampers, Relief Dampers, and many others
th: เราผลิตและจัดจำหน่ายแดมเปอร์หลากหลายประเภท อาทิเช่น แดมเปอร์ทนไฟ 3 ชั่วโมง (ทดสอบโดยสถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง ตามมาตรฐาน UL 555) ไฟร์สโม้คแดมเปอร์ทนไฟ 3 ชั่วโมง (ทดสอบโดยสถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง ตามมาตรฐาน UL 555 และ UL 555S) วอลุ่มแดมเปอร์ มอเตอร์ไรซ์แดมเปอร์ กราวิตี้แดมเปอร์ และรีลีฟแดมเปอร์

# meta-title-ds
source: Duct silencers
th: ดักท์ไซเลนเซอร์

# meta-desc-ds
source: PCJ manufactures and supplies Duct Silencers and Acoustic Louvers which are dynamic insertion loss (dB) tested and certified by N.A.T.A., Australia, AS 1277. Available for rectangular and round shape at any sizes (made to order) upon request.
th: เราผลิตและจัดจำหน่ายดักไซเลนเซอร์และอคูสติกลูเวอร์ ซึ่งผ่านการทดสอบการลดทอนเสียง และได้รับการรับรองโดย N.A.T.A., Australia, AS 1277 มีให้เลือกทั้งแบบเหลี่ยมและกลม ทุกขนาดตามต้องการ

# meta-title-aol
source: Air outlets (Air grilles)
th: หน้ากากแอร์

# meta-desc-aol
source: PCJ manufactures and supplies various types of Air Outlets, i.e. : Round Ceiling Diffusers, Square Ceiling Diffusers, Rectangular Ceiling Diffusers, Air Grilles, Egg Crate Grilles, Supply Air Registers, Opposed Blade Volume Dampers, Linear Slot Diffusers, Linear Bar Grilles, Insect Screens, Air Filters, Air Louvers. Some types are performance tested and certified by N.A.T.A., Australia, AS 1277 & ADC 1062 : GRID-84. Each type is designed suitable for each particular function.
th: เราผลิตและจัดจำหน่ายหน้ากากแอร์หลากหลายรูปแบบ อาทิ หน้ากากแอร์แบบกลม หน้ากากแอร์แบบจัตุรัส หน้ากากแอร์แบบสี่เหลี่ยมผืนผ้า แอร์กริล หน้ากากแอร์สี่เหลี่ยมลังไข่ หน้ากากแอร์แบบใบปรับได้สองชั้น แดมเปอร์สำหรับหน้ากากแอร์ หน้ากากแอร์แบบสล็อต หน้ากากแอร์แบบแนวยาว มุ้งลวดกันแมลง แอร์ฟิลเตอร์ แอร์ลูเวอร์ เป็นต้น ซึ่งหน้ากากแอร์หลายประเภทได้รับการทดสอบประสิทธิภาพและรับรองโดย N.A.T.A., Australia, AS 1277 & ADC 1062 : GRID-84 โดยหน้ากากแต่ละประเภทถูกออกแบบมาเพื่อรองรับการใช้งานตามความต้องการเฉพาะทาง

# meta-kw-home
source: Steel Door, Fire-Rated Steel Door, Fire Door, Fireproof Door, Fire Resistance Door, UL, UL Door, BS, BS Door, Fire Damper, UL Fire Damper, UL Damper, Fire Damper Curtain Type, Fire Smoke Damper, Duct Damper, Other Damper, Damper, Duct Silencer, Acoutic Louver, Air Outlet, Air Grille
th: ประตูเหล็กทนไฟ, ประตูทนไฟ, ประตูหนีไฟ, UL, ประตู UL , BS, ประตู BS, ประตูเหล็ก, ประตู, ไฟร์แดมเปอร์, แดมเปอร์ทนไฟ, ไฟร์แดมเปอร์ UL, แดมเปอร์ UL, แดมเปอร์ทนไฟชนิดม่านตก, ไฟร์สโม้คแดมเปอร์, ดักแดมเปอร์, แดมเปอร์อืนๆ, แดมเปอร์, ดักไซเลนเซอร์, อคูสติกลูเวอร์, หน้ากากแอร์, กริลแอร์

# meta-kw-frd
source: Steel Door, Fire-Rated Steel Door, Fire Door, Fireproof Door, Fire Resistance Door, UL, UL Door, BS, BS Door
th: ประตูเหล็กทนไฟ, ประตูทนไฟ, ประตูหนีไฟ, UL, ประตู UL , BS, ประตู BS, ประตูเหล็ก, ประตู

# meta-kw-fdc
source: Fire Damper, UL Fire Damper, UL Damper, Fire Damper Curtain Type
th: ไฟร์แดมเปอร์, แดมเปอร์ทนไฟ, ไฟร์แดมเปอร์ UL, แดมเปอร์ UL, แดมเปอร์ทนไฟชนิดม่านตก

# meta-kw-fsd-ul
source: Fire Smoke Damper
th: ไฟร์สโม้คแดมเปอร์

# meta-kw-ddp
source: Duct Damper, Other Damper, Damper
th: ดักแดมเปอร์, แดมเปอร์อืนๆ, แดมเปอร์

# meta-kw-ds
source: Duct Silencer, Acoutic Louver
th: ดักไซเลนเซอร์, อคูสติกลูเวอร์

# meta-kw-aol
source: Air Outlet, Air Grille
th: หน้ากากแอร์, กริลแอร์

# home-intro-header
source: PCJ INDUSTRIES
th: บริษัท พีซีเจ อุตสาหกรรม จำกัด

# home-intro-content
source: We are a manufacturer and supplier of steel doors, fire-rated steel doors, fire dampers, other dampers, air outlets (air grilles), duct silencers, and acoustic louvers. Our products have been tested and certified in accordance with various international standards from world class institutions. We also have experience in this market for more than 20 years. Therefore, you can trust in excellent quality of our products as well as services from us
th: เราเป็นผู้ผลิตและจัดจำหน่าย ประตูเหล็กทนไฟ ประตูเหล็กธรรมดา แดมเปอร์ทนไฟ แดมเปอร์อื่นๆ หน้ากากแอร์ ดักไซเลนเซอร์ และอคูสติกลูเวอร์ สินค้าของเราผ่านการทดสอบตามมาตรฐานสากลจากสถาบันชั้นนำมากมาย อีกทั้งเรายังมีประสบการณ์ในวงการมากกว่า 20 ปี ท่านจึงมั่นใจได้ในคุณภาพของสินค้าและบริการที่ดีเยี่ยมของพีซีเจ

# home-frd-header
source: Steel Doors and Fire-Rated Steel Doors
th: ประตูเหล็กทนไฟ และ ประตูเหล็กธรรมดา

# home-frd-content
source: <p>Steel doors and fire-rated steel doors, "Classic Steel" brand, manufactured and supplied by PCJ INDUSTRIES are strong, elegant, and durable. The doors have been tested and certified as per many international standards, for instance, ANSI/UL 10C & CAN/ULC-S104 fire rating standard, BS476 fire rating standard , Thai Industrial Standards (TIS) 1220-2541 and 1288-2538. Our fire-rated steel doors and steel doors are available in a variety of types and styles, for example,</p><ul><li>Single door leaf, Double door leaf</li><li>Flush style, Flush with vision panel style</li><li>Embossed style</li><li>Powder finish, Wood grain finish</li></ul>
th: <p>ประตูเหล็กทนไฟ และ ประตูเหล็กธรรมดา ภายใต้แบรนด์ Classic Steel ผลิตและจัดจำหน่ายโดยบริษัท พีซีเจ อุตสาหกรรม จำกัด มีความแข็งแรง สวยงาม ทนทาน ผ่านการทดสอบมาตรฐานชั้นนำมากมาย อาทิเช่น มาตรฐานการทนไฟ ANSI/UL 10C & CAN/ULC-S104, มาตรฐานการทนไฟ BS476, มาตรฐานอุตสาหกรรม 1220-2541 และ 1288-2538 เป็นต้น ประตูเหล็กทนไฟ และประตูเหล็กธรรมดาของเรา มีให้เลือกหลากหลายรูปแบบและสไตล์ อาทิ</p><ul><li>ประตูบานเดี่ยว, ประตูบานคู่</li><li>ประตูบานเรียบทึบ, ประตูบานเรียบมีช่องกระจก</li><li>ประตูบานลูกฟัก</li><li>เคลือบสีผง, เคลือบลายไม้</li></ul>

source: More Details
th: รายละเอียดเพิ่มเติม

# home-fdc-header
source: Fire Dampers
th: แดมเปอร์ทนไฟ

# home-fdc-content
source: Fire dampers, "Stream Air" brand, manufactured and supplied by PCJ INDUSTRIES, have been tested and certified by Underwriter Laboratories (UL), USA, for 3-hour fire rating as per ANSI/UL 555 & CAN/ULC-S112. Fire dampers can be mounted vertically on masonry/gypsum walls. The dampers are designed to automatically close by gravity in the event of fire when temperature at the dampers reaches up to 165°F (74°C) in order to block the spread of flame passing through the walls. Our dampers are available in many types, for example,</p><ul><li>Fire damper, curtain type, in airstream</li><li>Fire damper, curtain type, out of airstream</li><li>Fire damper, curtain type, multiple section</li></ul>
th: <p>แดมเปอร์ทนไฟ ภายใต้แบรนด์ Stream Air ผลิตและจัดจำหน่ายโดยบริษัท พีซีเจ อุตสาหกรรม จำกัด มีอัตราการทนไฟ 3 ชั่วโมงตามมาตรฐาน ANSI/UL 555 & CAN/ULC-S112 ผ่านการทดสอบโดย Underwriter Laboratories (UL) สหรัฐอเมริกา สามารถติดตั้งในแนวตั้งกับผนังปูน หรือผนังยิปซั่มได้ แดมเปอร์ทนไฟถูกออกแบบมาให้ปิดอัตโนมัติโดยแรงโน้มถ่วงในเหตุการณ์ไฟไหม้เมื่ออุณหภูมิที่แดมเปอร์สูงถึง 165 องศาฟาเรนไฮต์ (74 องศาเซลเซียส) เพื่อป้องกันไม่ให้ไฟลามทะลุไปยังอีกฝั่งของผนัง แดมเปอร์ทนไฟของเรามีให้เลือกหลากหลายรูปแบบ อาทิ</p><ul><li>ไฟร์แดมเปอร์ แบบม่านตก ชนิดใบอยู่ในช่องลม (In Airstream)</li><li>ไฟร์แดมเปอร์ แบบม่านตก ชนิดใบอยู่นอกช่องลม (Out of Airstream)</li><li>ไฟร์แดมเปอร์ แบบม่านตก แบบหลายตัวต่อกัน (Multiple Section)</li></ul>

# home-ddp-header
source: Other Dampers
th: แดมเปอร์อื่นๆ

# home-ddp-content
source: <p>Dampers, "Stream Air" brand, manufactured and supplied by PCJ INDUSTRIES, are constructed of galvanized steel sheets for rustproof and durability properties. The dampers have been tested as per many international standards by leading institutions of Thailand, such as, UL 555 and UL 555s by King Mongkut's Institute of Technology Ladkrabang (KMIT). Our dampers are available in various type to fulfill most requirements, for example,</p><ul><li>Volume dampers (rectangular shape, round shape, flat oval shape)</li><li>Motorized dampers (rectangular shape, round shape, flat oval shape)</li><li>Combination of fire & smoke dampers</li><li>Gravity dampers</li><li>Relief dampers</li></ul>
th: <p>แดมเปอร์ภายใต้แบรนด์ Stream Air ผลิตและจัดจำหน่ายโดยบริษัท พีซีเจ อุตสาหกรรม จำกัด ผลิตจากเหล็กชุบกัลวาไนซ์ ป้องกันสนิม อายุการใช้งานยาวนาน ผ่านการทดสอบมาตรฐานสากล จากสถาบันชั้นนำของประเทศไทย อาทิ มาตรฐาน UL 555 และ UL 555S จากสถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง แดมเปอร์ของเรามีให้เลือกหลากหลายประเภท เพื่อรองรับการใช้งานตามความต้องการเฉพาะทาง อาทิเช่น</p><ul><li>วอลุ่มแดมเปอร์ แบบสี่เหลี่ยม, แบบกลม, แบบวงรี</li><li>มอเตอร์ไรซ์แดมเปอร์ แบบสี่เหลี่ยม, แบบกลม, แบบวงรี</li><li>ไฟร์สโมคแดมเปอร์</li><li>กราวิตี้แดมเปอร์</li><li>รีลีฟแดมเปอร์</li></ul>

# home-ds-header
source: Duct Silencers and Acoustic Louvers
th: ดักไซเลนเซอร์ และ อคูสติกลูเวอร์

# home-ds-content
source: <p>Our duct silencers and acoustic louver, "Stream Air" brand, have been tested and certified by N.A.T.A., Australia, for dynamic insertion loss (dB) as per AS 1277, available in rectangular and round shape at any sizes upon request (made to order). The products can be mounted vertically or horizontally to reduce sound to desired levels as per requirements.</p>
th: <p>ดักไซเลนเซอร์และอคูสติกลูเวอร์ ของพีซีเจผ่านการทดสอบการลดทอนเสียง และได้รับการรับรองโดย N.A.T.A., Australia, AS 1277 สินค้าของเรามีให้เลือกทั้งแบบสี่เหลี่ยมและแบบกลม ทุกขนาดตามต้องการ ซึ่งสามารถติดตั้งได้ทั้งแนวตั้งและแนวราบเพื่อลดทอนเสียงให้อยู่ในระดับความดังที่ต้องการ</p>

# home-aol-header
source: Air Outlets
th: หน้ากากแอร์

# home-aol-content
source: <p>A variety of types of air outlets (air grilles), "Stream Air" brand, manufactured and supplied by PCJ INDUSTRIES have been tested and certified by N.A.T.A., Australia, for acoustic and air flow performance in accordance with AS 1277 & ADC 1062 : GRID-84. Our air outlets are available in many designs to fulfill most requirements, for example,</p><ul><li>Round ceiling diffusers</li><li>Square/Rectangular ceiling diffusers</li><li>Egg crate grilles</li><li>Double deflection grilles</li><li>Linear slot diffusers</li><li>Linear bar grilles</li><li>Air louvers</li><li>Accessories of air outlets, such as, Opposed blade volume dampers, Insect screens, Air filters</li></ul>
th: <p>หน้ากากแอร์ (กริลแอร์) ผลิตและจัดจำหน่ายโดย บริษัท พีซีเจ อุตสาหกรรม จำกัด หลายประเภท ผ่านการทดสอบเสียงและการไหลผ่านของอากาศและรับรองโดย N.A.T.A., Australia, AS 1277 & ADC 1062 : GRID-84 หน้ากากแอร์ของเรามีหลากหลายรูปแบบ ถูกออกแบบมาเพื่อรองรับการใช้งานตามความต้องการเฉพาะทาง อาทิเช่น</p><ul><li>หน้ากากแอร์แบบกลม (Round Ceiling Diffuser)</li><li>หน้ากากแอร์แบบสี่เหลี่ยมจัตุรัส/แบบสี่เหลี่ยมผืนผ้า (Square/Rectangular Ceiling Diffuser)</li><li>หน้ากากแอร์สี่เหลี่ยมลังไข่ (Egg Crate Grille)</li><li>หน้ากากแอร์แบบใบปรับได้สองชั้น (Double Deflection)</li><li>หน้ากากแอร์แบบสล็อต (Linear Slot Diffuser)</li><li>หน้ากากแอร์แบบแนวยาว (Linear Bar Grille)</li><li>แอร์ลูเวอร์</li><li>อุปกรณ์เสริมหน้ากากแอร์ เช่น แดมเปอร์สำหรับหน้ากากแอร์, มุ้งลวดกันแมลง, แอร์ฟิลเตอร์</li></ul>

# list-frd-content-1
source: <p>Fire-rated steel doors (fire emergency exit doors) by PCJ are constructed of steel sheets with advance technique of reinforcement to be very strong (heavy duty). The doors have been tested and certified by Underwriter Laboratories (UL), USA, for 3-hour fire rating as per ANSI/UL 10C & CAN/ULC-S104. A variety of types and styles of our doors are available upon request to fulfill most requirements, for example,</p><ul><li>Single door leaf, Double door leaf</li><li>Flush style, Flush with vision panel style</li><li>Embossed style</li><li>Powder finish, Wood grain finish</li></ul><p>Moreover, we also supply a plenty of types of door hardware upon request.</p>
th: <p>ประตูเหล็กทนไฟ (ประตูหนีไฟ) ของพีซีเจ ผลิตจากเหล็กแผ่นเรียบ ด้วยกรรมวิธีพิเศษในการเสริมความแข็งแรง (สำหรับการใช้งานหนัก) ได้รับการทดสอบและรับรองอัตราการทนไฟ 3 ชั่วโมง ตามมาตรฐาน ANSI/UL 10C & CAN/ULC-S104 จากสถาบัน Underwriter Laboratories (UL) ประเทศสหรัฐอเมริกา ประตูของเรามีให้เลือกหลากหลายประเภทและสไตล์ อาทิ</p><ul><li>ประตูบานเดี่ยว, ประตูบานคู่</li><li>ประตูบานเรียบทึบ, ประตูบานเรียบมีช่องกระจก</li><li>ประตูบานลูกฟัก</li><li>เคลือบสีผง, เคลือบลายไม้</li></ul><p>และเรายังจัดจำหน่ายอุปกรณ์ประตูหลากหลายประเภทตามความต้องการอีกด้วย</p>

# list-frd-content-2
source: <p>Our doors are made to order. Sizes are available upon request up to maximum 1200 mm. X 2400 mm. for single door and 2400 mm. X 2400 mm. for double door. We recommend application of our doors for not only fire escape purpose, but also any other where fire/burglar protection are needed.</p><p>We also manufacture and supply 2-hour fire rating door, tested by Chulalongkorn University in accordance with BS476 and TIS (Thai Industrial Standards) 1220-2541 as well as steel door as per TIS 1288-2538 to fulfill most requirements.</p>
th: <p>ประตูของเราเป็นสินค้าสั่งผลิต สามารถเลือกขนาดได้ตามความต้องการ โดยที่ขนาดใหญ่สุดคือ 1200 มม. X 2400 มม. สำหรับประตูบานเดี่ยว และ 2400 มม. X 2400 มม. สำหรับประตูบานคู่ แนะนำการใช้งานไม่เพียงแต่เฉพาะประตูทางหนีไฟ แต่รวมไปถึงประตูห้องที่ต้องการการทนไฟ หรือป้องกันการงัดขโมยด้วย</p><p>อีกทั้งเรายังผลิตและจัดจำหน่ายประตูเหล็กทนไฟ 2 ชั่วโมงตามมาตรฐาน BS476 ทดสอบโดยจุฬาลงกรณ์มหาวิทยาลัย, มาตรฐาน มอก. 1220-2541 และประตูเหล็กธรรมดาตามมาตรฐาน มอก. 1288-2538 เพื่อตอบสนองความต้องการของการใช้งานทุกประเภท</p>

# product-images
source: Product Gallery
th: ตัวอย่างรูปสินค้า

# single-door
source: Single Door Leaf
th: ประตูบานเดี่ยว

# double-door
source: Double Door Leaf
th: ประตูบานคู่

source: Flush Style
th: ประตูบานเรียบทึบ

# vision-style
source: Flush with Vision Panel Style
th: ประตูบานเรียบมีช่องกระจก

# embossed-5
source: Embossed Style, 5 Panels
th: ประตูบานลูกฟัก 5 ช่อง

# embossed-11
source: Embossed Style, 11 Panels
th: ประตูบานลูกฟัก 11 ช่อง

source: Powder Finish
th: ประตูเคลือบอบสีผง

source: Wood Grain Finish
th: ประตูเคลือบอบสีลายไม้

source: Door Hardware
th: อุปกรณ์ประตู

# door-closer-1
source: <h6>Swinging Fire Door Closer</h6><ul><li>Surface Mounted</li><li>Non-Hold Open, Regular Arm</li><li>Can be opened 180°</li><li>For door leaf weight 60-85 Kgs</li><li>3-Hour Fire Rating, UL 10C</li></ul>
th: <h6>Swinging Fire Door Closer</h6><ul><li>ติดตั้งบนบานประตู</li><li>แขนปกติ แบบเปิดประตูค้างไม่ได้</li><li>เปิดได้ 180°</li><li>รองรับประตูหนัก 60-85 กิโลกรัม</li><li>อัตราการทนไฟ 3 ชั่วโมง UL 10C</li></ul>

# door-closer-2
source: <h6>Swinging Fire Door Closer, Heavy Duty</h6><ul><li>Surface Mounted</li><li>Non-Hold Open, Regular Arm</li><li>Can be opened 180°</li><li>For door leaf weight 15-150 Kgs</li><li>3-Hour Fire Rating, UL 10C</li><li>ANSI Grade 1</li></ul>
th: <h6>Swinging Fire Door Closer, Heavy Duty</h6><ul><li>ติดตั้งบนบานประตู</li><li>แขนปกติ แบบเปิดประตูค้างไม่ได้</li><li>เปิดได้ 180°</li><li>รองรับประตูหนัก 15-150 กิโลกรัม</li><li>อัตราการทนไฟ 3 ชั่วโมง UL 10C</li><li>ANSI เกรด 1</li></ul>

# esc
source: <h6>Escutcheon Lever Trim with Cylinder</h6><ul><li>To be used in combination with exit device</li></ul>
th: <h6>Escutcheon Lever Trim with Cylinder</h6><ul><li>สำหรับใช้งานคู่กับคานผลัก</li></ul>

# lever-trim
source: <h6>Lever Trim with Cylinder</h6><ul><li>To be used in combination with exit device</li></ul>
th: <h6>Lever Trim with Cylinder</h6><ul><li>สำหรับใช้งานคู่กับคานผลัก</li></ul>

# m3485
source: <h6>Fire Mortise Lock, Cylinder with Thumbturn</h6><ul><li>3-Hour Fire Rating, UL 10C</li></ul>
th: <h6>Fire Mortise Lock, Cylinder with Thumbturn</h6><ul><li>อัตราการทนไฟ 3 ชั่วโมง UL 10C</li></ul>

# magnet-door-holder
source: <h6>Electromagnetic Door Holders</h6><ul><li>Floor Mounted</li><li>UL 228</li></ul>
th: <h6>Electromagnetic Door Holders</h6><ul><li>ติดตั้งบนพื้น</li><li>UL 228</li></ul>

# fire-rim
source: <h6>Fire Exit Device, Rim Type</h6><ul><li>3-Hour Fire Rating, UL 10C</li></ul>
th: <h6>Fire Exit Device, Rim Type</h6><ul><li>อัตราการทนไฟ 3 ชั่วโมง UL 10C</li></ul>

# fire-rim-mortise
source: <h6>Fire Rated Mortise Exit Device</h6><ul><li>3-Hour Fire Rating, UL 10C</li></ul>
th: <h6>Fire Rated Mortise Exit Device</h6><ul><li>อัตราการทนไฟ 3 ชั่วโมง UL 10C</li></ul>

# fire-v-rod
source: <h6>Fire Exit Device, Vertical Rod Type</h6><ul><li>3-Hour Fire Rating, UL 10C</li></ul>
th: <h6>Fire Exit Device, Vertical Rod Type</h6><ul><li>อัตราการทนไฟ 3 ชั่วโมง UL 10C</li></ul>

# fire-v-rod-mortise
source: <h6>Fire Rated Concealed Vertical Rod Exit Device</h6><ul><li>3-Hour Fire Rating, UL 10C</li></ul>
th: <h6>Fire Rated Concealed Vertical Rod Exit Device</h6><ul><li>อัตราการทนไฟ 3 ชั่วโมง UL 10C</li></ul>

# smoke-seal
source: <h6>Smoke Seal</h6><ul><li>3-Hour Fire Rating, UL 10C</li></ul>
th: <h6>Smoke Seal</h6><ul><li>อัตราการทนไฟ 3 ชั่วโมง UL 10C</li></ul>

# bb-hinge
source: <h6>BB Hinge</h6><ul><li>Stainless Steel, Grade 304</li><li>3-Hour Fire Rating, UL 10C</li></ul>
th: <h6>BB Hinge</h6><ul><li>สแตนเลสเกรด 304</li><li>อัตราการทนไฟ 3 ชั่วโมง UL 10C</li></ul>

# bottom-seal
source: <h6>Automatic Door Bottom Seal</h6><ul><li>The seal automatically comes out to close the gap beneath the door leaf when the door leaf is completely closed, and automatically retract when the door starts to be opened.</li><li>3-Hour Fire Rating, UL 10C</li></ul>
th: <h6>Automatic Door Bottom Seal</h6><ul><li>ซีลจะเลื่อนลงมาปิดช่องว่างใต้บานประตูอัตโนมัติเมื่อประตูปิดสนิท และจะยกขึ้นอัตโนมัติเมื่อประตูเปิด</li><li>อัตราการทนไฟ 3 ชั่วโมง UL 10C</li></ul>

# door-coordinator
source: <h6>Fire Door Coordinator</h6><ul><li>Surface Mounted</li><li>3-Hour Fire Rating, UL 10C</li></ul>
th: <h6>Fire Door Coordinator</h6><ul><li>ติดตั้งบนวงกบ</li><li>อัตราการทนไฟ 3 ชั่วโมง UL 10C</li></ul>
