Repository: ekasit-ja/pcj-django
Catalog: locale/*/LC_MESSAGES/django.po
Languages: th

source: home
th: หน้าแรก

source: about
th: เกี่ยวกับเรา

source: products
th: สินค้า

source: projects
th: ผลงาน

source: news
th: ข่าวสาร

source: contact
th: ติดต่อเรา

# career
source: careers
th: ร่วมงานกับเรา

# frd-&-non-frd
source: Steel Doors & Fire-Rated Steel Doors
th: ประตูเหล็กทนไฟ และ <br>ประตูเหล็กไม่ทนไฟ

# fdc
source: Fire Dampers
th: แดมเปอร์ทนไฟ

# fsd-ul
source: Combination of Fire & Smoke Dampers
th: ไฟร์และสโมคแดมเปอร์

# ddp
source: Other Dampers
th: แดมเปอร์อื่นๆ

# ds
source: Duct Silencers & Acoustic Louvers
th: ดักท์ไซเลนเซอร์ และ <br>อคูสติกลูเวอร์

# aol
source: Air Outlets
th: หน้ากากแอร์

source: Quality you can trust
th: คุณภาพที่คุณวางใจได้

# quality-you-can-trust-content-1
source: For over
th: ด้วยประสบการณ์ที่สั่งสมมาอย่างยาวนานกว่า

# quality-you-can-trust-content-2
source: years of experience, PCJ INDUSTRIES has delivered high quality products to all regions of Thailand and many countries around the world. We have been known throughout the construction field for high quality products and reliable services. With leading technologies on product lines, team of professional in this field, certificates from Underwriter Laboratories, British Standards Institution, Standards Australia, Air Diffusion Council, Thai Industrial Standards Institute, and quality management system ISO 9001:2008, you can put your trust in our products and services. Our objective is to ensure fast delivery of exceptional products to let your projects complete as planned without interruption.
th: ปี บริษัท พีซีเจ อุตสาหกรรม จำกัด ได้ทำการส่งมอบผลิตภัณฑ์คุณภาพสูงทั่วทุกภูมิภาคของประเทศไทย และอีกหลายประเทศทั่วโลก จนเป็นที่รู้จักและให้การยอมรับอย่างกว้างขวางในวงการก่อสร้าง ทั้งในด้านคุณภาพของสินค้าที่เชื่อถือได้ และบริการที่ตรงต่อเวลา ด้วยสายการผลิตที่มีเครื่องมือชั้นนำ ทีมบุคลากรผู้เชี่ยวชาญ ใบรับรองมาตรฐานจาก Underwriter Laboratories, British Standards Institution, Standards Australia, Air Diffusion Council, สำนักงานมาตรฐานผลิตภัณฑ์อุตสาหกรรม และมาตรฐานการควบคุมคุณภาพ ISO 9001:2008 จึงมั่นใจได้ในสินค้าและบริการของเรา ที่สามารถส่งตรงถึงคุณได้อย่างรวดเร็ว เป็นที่น่าพอใจ เพื่อให้งานของคุณไม่ติดขัดและเสร็จสิ้นได้ตามเป้าหมาย

source: view all projects
th: ดูผลงานทั้งหมด

source: follow us
th: ติดตามเรา

source: about us
th: เกี่ยวกับเรา

source: contact us
th: ติดต่อเรา

# about-us-content-1
source: We, PCJ INDUSTRIES CO., LTD., was established in 1998, specialize in production of Steel Doors, Fire-Rated Steel Doors, Fire Damper, Other Dampers, Duct Silencers, Acoustic Louvers, and Air Outlets (Air Grilles). Most of our products are certified by several organization for standardization, i.e.: Underwriters Laboratories (UL), British Standards Institutuion (BSI), Standards Australia, Air Diffusion Council, Thai Industrial Standards Institute. Moreover, our company is certified by International Organization for Standardization, ISO 9001:2008 as well.
th: บริษัท พีซีเจ อุตสาหกรรม จำกัด ก่อตั้งขึ้นปี พ.ศ. 2541 เราเป็นผู้เชี่ยวชาญด้านการผลิต ประตูเหล็กทนไฟ ประตูเหล็กธรรมดา แดมเปอร์ทนไฟ แดมเปอร์อื่นๆ ดักไซเลนเซอร์ อคูสติกลูเวอร์ และหน้ากากแอร์ (กริลแอร์) สินค้าของเรานั้นผ่านการรับรองคุณภาพต่างๆ มากมายจากองค์กรชั้นนำทั่วโลก อาทิเช่น Underwriters Laboratories (UL), British Standards Institutuion (BSI), Standards Australia, Air Diffusion Council, และสำนักงานมาตรฐานผลิตภัณฑ์อุตสาหกรรม กระทรวงอุตสาหกรรม อีกทั้งบริษัทของเรายังได้รับการรับรองมาตรฐาน ISO 9001:2008 จาก International Organization for Standardization อีกด้วย

# about-us-content-2
source: Our factory is established on our own land, area 40,000 sq.m.(approx), in Kaengkhoi, Saraburi, Thailand. Our policy is always on-time production and delivery with quality, reliability, and competitively priced products. We have been investing in instruments and machines. Besides, we have experienced engineer teams taking full time to continuously research and develop our product lines, including new product designs to meet worldwide market demands.
th: โรงงานของเราก่อสร้างขึ้นบนที่ดินของเราเอง ซึ่งมีพื้นที่กว่า 40,000 ตารางเมตร ในอำเภอแก่งคอย จังหวัดสระบุรี ประเทศไทย นโยบายที่สำคัญที่สุดของเราคือการผลิตและจัดส่งสินค้าตรงต่อเวลา ด้วยคุณภาพที่ไว้วางใจได้ และราคาที่น่าดึงดูด โดยตลอดเวลาเสมอมา เราได้ลงทุนกับเครื่องมือและเครื่องจักรอย่างต่อเนื่อง อีกทั้งเรายังมีทีมวิศกรผู้เชี่ยวชาญ เพื่อวิจัยและพัฒนาเต็มเวลาอย่างต่อเนื่อง ในการพัฒนาสายการผลิต และสินค้าใหม่ๆ เพื่อตอบสนองความต้องการในตลาดระดับโลก

# career-content-1
source: We are pleased to have you join our PCJ family and grow together. We open for many job positions. If you are interested, please email us your resume, supported documents, and a formal portrait to below email address.
th: มาร่วมเป็นส่วนหนึ่งกับครอบครัวพีซีเจและเติบโตไปด้วยกัน เรารับสมัครตำแหน่งงานจำนวนมาก หากคุณสนใจกรุณาส่งใบสมัคร เอกสารประกอบ และรูปถ่ายของคุณมาที่อีเมล์ด้านล่างนี้

# career-content-2
source: or drop hard copy of your documents at our headquarters at below address. We promise to contact you back at soonest.
th: หรือยื่นเอกสารที่สำนักงานใหญ่ของเราโดยตรงตามที่อยู่ด้านล่างนี้ เราจะทำการติดต่อกลับโดยเร็วที่สุด

# pcj-industries-full
source: PCJ INDUSTRIES COMPANY LIMITED
th: บริษัท พีซีเจ อุตสาหกรรม จำกัด

# pcj-industries-short
source: PCJ INDUSTRIES
th: พีซีเจ อุตสาหกรรม

source: Headquarters
th: สำนักงานใหญ่

source: Factory
th: โรงงาน

# pcj-office-road
source: 199/24-25 Vibhavadeerangsit road,
th: 199/24-25 ถนนวิภาวดีรังสิต

# pcj-office-area
source: Samsennai, Payathai,
th: แขวงสามเสนใน เขตพญาไท

# pcj-office-province
source: Bangkok 10400, Thailand
th: จังหวัดกรุงเทพ 10400, ประเทศไทย

# pcj-office-work-hour
source: Mon - Sat, 8:30AM - 5:30PM (ICT)
th: จันทร์ - เสาร์, เวลา 8:30 - 17:30

# pcj-factory-road
source: 45/2 Kaengkhoi-Salaengpan Road, Moo 8,
th: 45/2 ถนนแก่งคอย-แสลงพัน หมู่ 8

# pcj-factory-area
source: Banpa, Kaengkhoi,
th: ตำบลบ้านป่า อำเภอแก่งคอย

# pcj-factory-province
source: Saraburi 18110, Thailand
th: จังหวัดสระบุรี 18110 ประเทศไทย

# pcj-factory-work-hour
source: Mon - Sat, 8:30AM - 5:30PM (ICT)
th: จันทร์ - เสาร์, เวลา 8:30 - 17:30

# job-positions-available
source: Available Job Positions
th: ตำแหน่งที่เปิดรับ

source: Sales Executive(lnternational)
th: พนักงานขาย (ต่างประเทศ)

source: Sales Executive(Domestic)
th: พนักงานขาย (ในประเทศ)

source: Sales Coordinator
th: พนักงานประสานงานขาย

source: Marketing Executive
th: พนักงานการตลาด

source: Purchasing Admin.
th: พนักงานจัดซื้อ

source: Accountant
th: พนักงานบัญชี

source: Finance Staff
th: พนักงานการเงิน

source: HR Admin.
th: พนักงงานบุคคล

source: Production Engineer
th: วิศวกรการผลิต

source: R&D Engineer
th: วิศวกรวิจัยและพัฒนา

source: QA Engineer
th: วิศวกรประกันคุณภาพ

source: Construction & Maintenance Engineer
th: วิศวกรก่อสร้างและซ่อมบำรุง

source: CAD Operator
th: พนักงานเขียนแบบ AutoCAD

source: Operator/Technician
th: ช่างเทคนิค

source: Warehouse Admin.
th: พนักงานดูแลคลังสินค้า

source: Production Admin.
th: พนักงานธุรการฝ่ายผลิต

source: filter by
th: เลือกดูเฉพาะ

source: select
th: เลือก

source: country
th: ประเทศ

source: year
th: ปี

source: all
th: ทั้งหมด

source: area
th: ที่ตั้ง

source: company
th: เครือบริษัท

# 404-text
source: Sorry, we couldn't find a page you are looking for.
th: ขออภัย เราไม่พบหน้าที่คุณต้องการ

# fire-steel-doors
source: Steel Doors & Fire-Rated Steel Doors
th: ประตูเหล็กทนไฟ และ ประตูเหล็กไม่ทนไฟ

# frd-vdo-commercial
source: PCJ Fire-Rated Steel Doors TV advertisement
th: โฆษณาทีวีประตูเหล็กทนไฟ พีซีเจ

source: Fire Dampers
th: แดมเปอร์ทนไฟ

source: , Vertical only
th: แนวตั้งเท่านั้น

# fdc-vdo-demonstrate
source: VDO demonstrates function of Fire Dampers, Model : FDC
th: วิดีโอสาธิตการทำงานของแดมเปอร์ทนไฟรุ่น FDC

# fdc-vdo-ul-01
source: Fire Damper of PCJ INDUSTRIES CO., LTD. tested for 3-hour fire rating in accordance with ANSI/UL 555 & CAN/ULC-S112 at UL LLC Northbrook, USA
th: ทดสอบแดมเปอร์ทนไฟของบริษัท พีซีเจ อุตสาหกรรม จำกัด เป็นเวลา 3 ชั่วโมง ตามมาตรฐาน ANSI/UL 555 & CAN/ULC-S112 ที่ UL LLC Northbrook, USA

# frd-vdo-ul-01
source: Fire-Rated Steel Door of PCJ INDUSTRIES CO., LTD. tested for 3-hour fire rating in accordance with ANSI/UL 10C & CAN/ULC-S104 at UL LLC Northbrook, USA
th: ทดสอบประตูเหล็กทนไฟของบริษัท พีซีเจ อุตสาหกรรม จำกัด เป็นเวลา 3 ชั่วโมง ตามมาตรฐาน ANSI/UL 10C & CAN/ULC-S104 ที่ UL LLC Northbrook, USA

# frd-vision-vdo-ul-01
source: Fire Door Glass Light Frame of PCJ INDUSTRIES CO., LTD. tested for 3-hour fire rating in accordance with ANSI/UL 10C & CAN/ULC-S104 at UL LLC Northbrook, USA
th: ทดสอบคิ้วกระจกทนไฟของบริษัท พีซีเจ อุตสาหกรรม จำกัด เป็นเวลา 3 ชั่วโมง ตามมาตรฐาน ANSI/UL 10C & CAN/ULC-S104 ที่ UL LLC Northbrook, USA

# duct-dampers
source: Other Dampers
th: แดมเปอร์อื่นๆ

source: Air Outlets
th: หน้ากากแอร์

# duct-silencers
source: Duct Silencers & Acoustic Louvers
th: ดักท์ไซเลนเซอร์ และ อคูสติกลูเวอร์

# duct-silencers-br
source: Duct Silencers & Acoustic Louvers
th: ดักท์ไซเลนเซอร์ และ<br> อคูสติกลูเวอร์

# quality-you-can-trust-detail-p1
source: For over
th: ด้วยประสบการณ์ที่สั่งสมมาอย่างยาวนานกว่า

# quality-you-can-trust-detail-p2
source: years of experience, PCJ INDUSTRIES has delivered high quality products to all regions of Thailand and many countries around the world. We have been known throughout the construction field for high quality products and reliable services. With leading technologies on product lines, team of professional in this field, certificates from Underwriter Laboratories, British Standards Institution, Standards Australia, Air Diffusion Council, Thai Industrial Standards Institute, and quality management system ISO 9001:2008, you can put your trust in our products and services. Our objective is to ensure fast delivery of exceptional products to let your projects complete as planned without interruption.
th: ปี บริษัท พีซีเจ อุตสาหกรรม จำกัด ได้ทำการส่งมอบผลิตภัณฑ์คุณภาพสูงทั่วทุกภูมิภาคของประเทศไทย และอีกหลายประเทศทั่วโลก จนเป็นที่รู้จักและให้การยอมรับอย่างกว้างขวางในวงการก่อสร้าง ทั้งในด้านคุณภาพของสินค้าที่เชื่อถือได้ และบริการที่ตรงต่อเวลา ด้วยสายการผลิตที่มีเครื่องมือชั้นนำ ทีมบุคลากรผู้เชี่ยวชาญ ใบรับรองมาตรฐานจาก Underwriter Laboratories, British Standards Institution, Standards Australia, Air Diffusion Council, สำนักงานมาตรฐานผลิตภัณฑ์อุตสาหกรรม และมาตรฐานการควบคุมคุณภาพ ISO 9001:2008 จึงมั่นใจได้ในสินค้าและบริการของเรา ที่สามารถส่งตรงถึงคุณได้อย่างรวดเร็ว เป็นที่น่าพอใจ เพื่อให้งานของคุณไม่ติดขัดและเสร็จสิ้นได้ตามเป้าหมาย

source: View All
th: ดูทั้งหมด

source: Type
th: ประเภท

source: Model you can choose
th: โมเดลที่คุณเลือกได้

source: Model
th: โมเดล

# no-models-available
source: No requested model is available at this time.
th: ไม่มีโมเดลที่ระบุในขณะนี้

# option-you-can-choose
source: Product available
th: สินค้าที่มีให้เลือก

source: Size
th: ขนาด

# available-upon-request-doors
source: Available upon request up to maximum 1200mm X 2400mm (for Single Door) and 2400mm X 2400mm (for Double Door)
th: สั่งทำได้ตามต้องการ ขนาดใหญ่สุด 1200มม X 2400มม (สำหรับบานเดี่ยว) และ 2400มม X 2400 มม (สำหรับบานคู่)

# available-upon-request-dampers
source: Available upon request up to maximum 48” X 48” (for Single Section) and 96” X 96” (for Multiple Section)
th: สั่งทำได้ตามต้องการ ขนาดใหญ่สุด 48 นิ้ว X 48 นิ้ว (สำหรับ Single Section) และ 96 นิ้ว X 96 นิ้ว (สำหรับ Multiple Section)

# available-upon-request-fsd-ul
source: Available upon request up to maximum 48” X 48”
th: สั่งทำได้ตามต้องการ ขนาดใหญ่สุด 48 นิ้ว X 48 นิ้ว

source: Fire Rating
th: อัตราการทนไฟ

# 0-3-hours
source: 3 hours in accordance with ANSI/UL 10C & CAN/ULC-S104
th: 3 ชั่วโมงตามมาตรฐาน ANSI/UL 10C & CAN/ULC-S104

# 3-hour-dampers
source: 3 hours in accordance with ANSI/UL 555 & CAN/ULC-S112
th: 3 ชั่วโมงตามมาตรฐาน ANSI/UL 555 & CAN/ULC-S112

# 3-hour
source: 3 hours
th: 3 ชั่วโมง

source: Door Style
th: แบบของประตู

# door-style-p1
source: Flush Style, Flush Style with Vision Panel, Embossed Style
th: แบบเรียบ, แบบเรียบมีช่องกระจก, แบบลูกฟัก

source: Door Type
th: ประเภทของประตู

# door-type-p1
source: Single Door, Double Door
th: บานเดี่ยว, บานคู่

source: Vision Panel
th: ช่องกระจก

# vision-panel-p1
source: Optional (Maximum exposed area of glazing is 100 square inches)
th: สั่งทำได้ (ช่องกระจกขนาดใหญ่สุด 100 ตารางนิ้ว)

source: Louvers
th: ช่องเกล็ด

# louvers-p1
source: Optional
th: สั่งทำได้

source: Door Closers
th: โช้คประตู

source: Door Locks
th: อุปกรณ์ล็อคประตู

source: Wheel Set
th: ลูกเลื่อนประตู

source: Door Handles
th: ด้านจับประตู

source: Door Holders
th: อุปกรณ์ยึดบานประตู

source: Fire Exit Devices
th: คานผลักประตูหนีไฟ

source: Etc.
th: อุปกรณ์อื่นๆ

# door-hinge
source: Door Hinges
th: บานพับประตู

source: Seal
th: ซีลประตู

# automatic-door-bottom
source: Automatic Door Seal
th: ซีลประตูอัตโนมัติ

# fire-door-coordinator
source: Door Coordinator
th: ตัวควบคุมการปิดประตู

# hardware-you-can-add
source: Hardware available
th: อุปกรณ์เสริมที่มีให้เลือก

source: Get A Quote
th: ขอใบเสนอราคา

source: Description
th: ข้อมูลสินค้า

# cert
source: Certificate
th: ใบรับรอง

# inst
source: Installation
th: คู่มือการติดตั้ง

# catg
source: Catalogue
th: แค็ตตาล็อก

source: Download
th: ดาวน์โหลด

# no-file-available
source: No file is available at this time.
th: ยังไม่มีไฟล์ข้อมูลในขณะนี้

# frd-p1
source: We manufacture and supply Fire-Rated Steel Doors, 3-Hour Fire Rating, ANSI/UL 10C & CAN/ULC-S104. Various type, styles, finish : Single Doors, Double Doors, Flush Doors, Flush with Vision Panels, Embossed Doors, Powder Finish, Wood Grain Finish as well as various types of hardware are available upon request. 2 Hour Fire-Rated Steel Doors and Steel Doors are also available upon request to fulfill most requirements.
th: เราผลิตและจัดจำหน่ายประตูเหล็กทนไฟ 3 ชั่วโมง ตามมาตรฐาน ANSI/UL 10C & CAN/ULC-S104 หลากหลายรูปแบบและสไตล์ อาทิ ประตูบานเดี่ยว ประตูบานคู่ ประตูบานเรียบทึบ ประตูบานเรียบมีช่องกระจก ประตูบานลูกฟัก เคลือบสีผง และเคลือบลายไม้ เป็นต้น และเรายังจัดจำหน่ายอุปกรณ์ประตูหลากหลายประเภทตามความต้องการ อีกทั้งเรายังมีผลิตและจัดจำหน่ายประตูเหล็กทนไฟ 2 ชั่วโมง และประตูเหล็กไม่ทนไฟ เพื่อตอบสนองความต้องการของการใช้งานทุกประเภท

# fdc-p1
source: We manufacture and supply fire dampers, 3-Hour Fire Rating, ANSI/UL 555 & CAN/ULC-S112 that can be mounted vertically on masonry/gypsum walls. The dampers are designed to automatically close by gravity in the event of fire when temperature at the dampers reach up to 165°F (74°C) in order to block the spread of flame pass through the walls.
th: เราผลิตและจัดจำหน่ายแดมเปอร์ทนไฟที่มีอัตราการทนไฟ 3 ชั่วโมงตามมาตรฐาน ANSI/UL 555 & CAN/ULC-S112 ซึ่งสามารถติดตั้งในแนวตั้งกับผนังปูน หรือผนังยิปซั่มได้ แดมเปอร์ถูกออกแบบมาให้ปิดอัตโนมัติโดยแรงโน้มถ่วงในเหตุการณ์ไฟไหม้เมื่ออุณหภูมิที่แดมเปอร์สูงถึง 165 องศาฟาเรนไฮต์ (74 องศาเซลเซียส) เพื่อป้องกันไม่ให้ไฟลามทะลุไปยังอีกฝั่งของผนัง

# ddp-p1
source: We manufacture and supply various types of dampers, ie. : Fire Dampers, 3-Hour Fire Rating, tested by KMIT in accordance with UL 555, Combination of Fire Dampers and Smoke Dampers, 3-Hour Fire Rating, tested by KMIT in accordance with UL 555&UL 555S, Volume Dampers, Motorized Dampers, Gravity Dampers, Relief Dampers. Each type is designed suitable for each particular function.
th: เราผลิตและจัดจำหน่ายแดมเปอร์หลากหลายประเภท อาทิเช่น แดมเปอร์ทนไฟ 3 ชั่วโมง ทดสอบโดยสถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง ตามมาตรฐาน UL 555 ไฟร์สโม้คแดมเปอร์ทนไฟ 3 ชั่วโมง ทดสอบโดยสถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง ตามมาตรฐาน UL 555 และ UL 555S วอลุ่มแดมเปอร์ มอเตอร์ไรซ์แดมเปอร์ กราวิตี้แดมเปอร์ และรีลีฟแดมเปอร์ เป็นต้น โดยแดมเปอร์แต่ละประเภทถูกออกแบบมาเพื่อรองรับการใช้งานตามความต้องการเฉพาะทาง

# aol-p1
source: We manufacture and supply various types of Air Outlets : Round Ceiling Diffusers, Square Ceiling Diffusers, Rectangular Ceiling Diffusers, Air Grilles, Egg Crate Grilles, Supply Air Registers, Opposed Blade Volume Dampers, Linear Slot Diffusers, Linear Bar Grilles, Insect Screens, Air Filters, Air Louvers. Some types are performance tested and certified by N.A.T.A., Australia, AS 1277 & ADC 1062 : GRID-84. Each type is designed suitable for each particular function.
th: เราผลิตและจัดจำหน่ายหน้ากากแอร์หลากหลายรูปแบบ อาทิ หน้ากากแอร์แบบกลม หน้ากากแอร์แบบจัตุรัส หน้ากากแอร์แบบสี่เหลี่ยมผืนผ้า แอร์กริล หน้ากากแอร์สี่เหลี่ยมลังไข่ หน้ากากแอร์แบบใบปรับได้สองชั้น แดมเปอร์สำหรับหน้ากากแอร์ หน้ากากแอร์แบบสล็อต หน้ากากแอร์แบบแนวยาว มุ้งลวดกันแมลง แอร์ฟิลเตอร์ แอร์ลูเวอร์ เป็นต้น ซึ่งหน้ากากแอร์หลายประเภทได้รับการทดสอบประสิทธิภาพและรับรองโดย N.A.T.A., Australia, AS 1277 & ADC 1062 : GRID-84 โดยหน้ากากแต่ละประเภทถูกออกแบบมาเพื่อรองรับการใช้งานตามความต้องการเฉพาะทาง

# ds-p1
source: We manufacture and supply Duct Silencers and Acoustic Louvers. The duct silencers have been dynamic insertion loss (dB) tested and certified by N.A.T.A., Australia, AS 1277. Available for rectangular and round shape at any sizes (made to order) upon request that can be mounted vertically or horizontally to reduce sound to desire levels as requrements.
th: เราผลิตและจัดจำหน่ายดักไซเลนเซอร์และอคูสติกลูเวอร์ ซึ่งผ่านการทดสอบการลดทอนเสียง และได้รับการรับรองโดย N.A.T.A., Australia, AS 1277 มีให้เลือกทั้งแบบเหลี่ยมและกลม ทุกขนาดตามต้องการ ซึ่งสามารถติดตั้งได้ตั้งแนวตั้งและแนวราบเพื่อลดทอนเสียงให้อยู่ในระดับความดังที่ต้องการ

# fsd-ul-p1
source: We manufacture and supply combination of Fire and Smoke Dampers, 3-Hour Fire Rating, that can be mounted vertically on masonry/gypsum walls, for both In-Wall and Out-of-Wall installation. The dampers are designed to automatically close by Actuators in the event of fire when temperature at the dampers and/or at the heat detectors that linked to the dampers reach up to 165°F (74°C), and/or when smoke at the smoke detector that linked to the dampers in order to block the spread of flame and/or smoke pass through the walls.
th: เราผลิตและจัดจำหน่ายไฟร์และสโมคแดมเปอร์ทนไฟ 3 ชั่วโมง ซึ่งสามารถติดตั้งในแนวตั้งบนผนังปูน หรือผนังยิปซั่มได้ และสามารถติดตั้งได้ทั้งแบบภายในผนัง และภายนอกผนัง แดมเปอร์ถูกออกแบบให้ปิดอัตโนมัติโดยแอคทูเอเตอร์ในเหตุการณ์ไฟไหม้เมื่ออุณหภูมิที่แดมเปอร์สูง และ/หรือ อุปกรณ์ตรวจจับความร้อนที่เชื่อมต่อกับแดมเปอร์ สูงถึง 165 องศาฟาเรนไฮต์ (74 องศาเซลเซียส) และ/หรือ อุปกรณ์ตรวจจับควันซึ่งเชื่อมต่อกับแดมเปอร์ตรวจพบควัน เพื่อป้องกันไม่ให้ไฟ และ/หรือ ควันทะลุผ่านไปยังอีกฝั่งของผนัง

# low-leak-p1
source: Optional
th: สั่งทำได้

# motorized-p1
source: Optional
th: สั่งทำได้

# no-finance-record
source: No finance record is available at this moment
th: ไม่มีประวัติการเงินแสดงในขณะนี้

# frd-desc
source: Constructed of steel sheets with high technic of reinforcement to be very strong (very heavy duty). The doors have been tested and certified for 3-hour fire rating as per ANSI/UL 10C & CAN/ULC-S104. Various type, styles, finish : Single Doors, Double Doors, Flush Doors, Flush with Vision Panels, Embossed Doors, Powder Finish, Wood Grain Finish as well as various types of hardware are available upon request to fulfill most requirements. Sizes can be made to order up to 1200 mm. x 2400 mm. for single door, and 2400 mm. x 2400 mm. for double door. Recommend to be used not only for fire escape doors, but also for room doors where fire/burglar protection are needed. 2-Hour Fire-Rated Steel Doors and Steel Doors are also available upon request to fulfill most requirements.
th: ผลิตจากเหล็กแผ่นเรียบ ด้วยกรรมวิธีพิเศษในการเสริมความแข็งแรง (สำหรับการใช้งานหนัก) ประตูเหล็กทนไฟได้รับการทดสอบและรับรองอัตราการทนไฟ 3 ชั่วโมง ตามมาตรฐาน ANSI/UL 10C & CAN/ULC-S104 มีให้เลือกหลากหลายประเภท และสไตล์ อาทิ ประตูบานเดี่ยว ประตูบานคู่ ประตูบานเรียบทึบ ประตูบานเรียบแบบมีช่องกระจก ประตูบานลูกฟัก เคลือบสีผง และเคลือบลายไม้ เป็นต้น และเรายังจัดจำหน่ายอุปกรณ์ประตูหลากหลายประเภทตามความต้องการ ประตูสามารถผลิตได้ที่ขนาดใหญ่สุด 1200 มม. X 2400 มม. สำหรับประตูบานเดี่ยว และ 2400 มม. X 2400 มม. สำหรับประตูบานคู่ แนะนำการใช้งานไม่เพียงแต่เฉพาะประตูทางหนีไฟ แต่รวมไปถึงประตูห้องที่ต้องการการทนไฟ หรือป้องกันการงัดขโมย อีกทั้งเรายังมีผลิตและจัดจำหน่ายประตูเหล็กทนไฟ 2 ชั่วโมงและประตูเหล็กไม่ทนไฟเพื่อตอบสนองความต้องการของการใช้งานทุกประเภท

# fdc-desc
source: Constructed of galvanized steel sheets, high strength structure, frame shape is modular design to be suitable for mounted in duct line as well as conecting together as multiple section. The dampers have been tested and certified for 3-hour fire rating as per ANSI/UL 555 & CAN/ULC-S112. Single Section, Multiple Section, In Air Stream, Out of Air Stream are available upon request to fulfill most requirements. Sizes can be made to order up to 1220 mm. x 1220 mm. (48" x 48") for single section, and 2440 mm. x 2440 mm.(96" x 96") for multiple section. Recommend to be used for blocking spread of fire pass through duct line, ventilation fan, air louver as well as indoor glass panel, especially large size of glass panel, etc, when fire or heat approach the dampers.
th: ผลิตจากสังกะสีแผ่นเรียบ ความแข็งแรงสูง เฟรมแบบมอดูลาร์สำหรับติดตั้งในท่อดักท์ และต่อหลายตัวเข้าด้วยกัน แดมเปอร์ได้รับการทดสอบและรับรองอัตราการทนไฟ 3 ชั่วโมง ตามมาตรฐาน ANSI/UL 555 & CAN/ULC-S112 แดมเปอร์มีจำหน่ายทั้งแบบ Single Section, Multiple Section, In Air Stream และ Out of Air Stream เพื่อตอบสนองความต้องการของการใช้งานทุกประเภท แดมเปอร์สามารถผลิตได้ที่ขนาดใหญ่สุด 1220 มม. x 1220 มม. (48” x 48”) สำหรับ Single Section และ 2440 มม. x 2440 มม. (96” x 96”) สำหรับ Multiple Section แนะนำการใช้งานสำหรับป้องกันไฟไม่ให้ลามผ่านท่อดักท์ พัดลมระบายอากาศ แอร์ลูเวอร์ หรือช่องกระจกภายในอาคาร โดยเฉพาะกับช่องขนาดใหญ่ เมื่อไฟหรือความร้อนมาถึงแดมเปอร์

# fsd-ul-desc
source: Constructed of galvanized steel sheets, high strength structure, frame shape is modular design to be suitable for mounted in duct line. The dampers have been tested and certified for 3-hour fire rating In-Wall Installation, Out-of-Wall Installation are available upon request to fulfill most requirements. Sizes can be made to order up to 1220 mm. x 1220 mm. (48" x 48"). Recommend to be used for blocking spread of fire and/or smoke pass through duct line, ventilation fan, air louver as well as indoor glass panel, especially large size of glass panel, etc., when fire/heat and/or smoke approach the dampers and/or the heat/smoke detector linked to the dampers.
th: ผลิตจากสังกะสีแผ่นเรียบ ความแข็งแรงสูง เฟรมแบบมอดูลาร์สำหรับติดตั้งในท่อดักท์ ไฟร์และสโมคแดมเปอร์ได้รับการทดสอบและรับรองอัตราการทนไฟ 3 ชั่วโมง แดมเปอร์มีจำหน่ายทั้งแบบติดตั้งในผนัง และติดตั้งนอกผนัง เพื่อตอบสนองความต้องการของการใช้งานทุกประเภท แดมเปอร์สามารถผลิตได้ที่ขนาดใหญ่สุด 1220 มม. x 1220 มม. (48” x 48”) แนะนำการใช้งานสำหรับป้องกันไฟ/ควัน ไม่ให้ลามผ่านท่อดักท์ พัดลมระบายอากาศ แอร์ลูเวอร์ หรือช่องกระจกภายในอาคาร โดยเฉพาะกับช่องขนาดใหญ่ เมื่อไฟ ความร้อน และ/หรือ ควัน มาถึงแดมเปอร์ และ/หรือ เครื่องตรวจจับความร้อน/ควัน ที่เชื่อมต่อกับแดมเปอร์

# ddp-desc
source: Constructed of galvanized steel sheets, high strength structure. Various types of dampers designed suitable for each particular function, Various type available, ie. : Fire Dampers, 3-Hour Fire Rating, tested by KMIT in accordance with UL 555, Combination of Fire Dampers and Smoke Dampers, 3-Hour Fire Rating, tested by KMIT in accordance with UL 555&UL 555S, Volume Dampers, Motorized Dampers, Gravity Dampers, Relief Dampers. Flange type, Plain End type, in-wall mounted actuator, out-of-wall mounted actuator are available upon request to fulfill most requirements. Sizes can be made to order.
th: ผลิตจากสังกะสีแผ่นเรียบ ความแข็งแรงสูง แดมเปอร์ประเภทต่างๆ ถูกออกแบบมาเพื่อรองรับการใช้งานตามความต้องการเฉพาะทาง แดมเปอร์มีจำหน่ายหลากหลายประเภท อาทิ แดมเปอร์ทนไฟ 3 ชั่วโมง ทดสอบโดยสถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง ตามมาตรฐาน UL 555 ไฟร์สโม้คแดมเปอร์ทนไฟ 3 ชั่วโมง ทดสอบโดยสถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง ตามมาตรฐาน UL 555 และ UL 555S วอลุ่มแดมเปอร์ มอเตอร์ไรซ์แดมเปอร์ กราวิตี้แดมเปอร์ และรีลีฟแดมเปอร์ แดมเปอร์สามารถผลิตได้ทั้งแบบมีหน้าแปลน แบบใส่เข้าไปในท่อดักท์ แอคทูเอเตอร์ในผนัง แอคทูเอเตอร์นอกผนัง เพื่อตอบสนองความต้องการของการใช้งานทุกประเภท ขนาดตามสั่ง
